sample-requests/sayHello-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns1:sayHello xmlns:ns1="http://example.org/">
      <name>World</name>
    </ns1:sayHello>
  </soap:Body>
</soap:Envelope>
